# DrawingAreaExtents Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..DrawingAreaExtents Property
UIApplication Class See Also
---
Get the rectangle that represents the screen pixel coordinates of drawing area.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public virtual Rectangle DrawingAreaExtents { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property DrawingAreaExtents As Rectangle
	Get
```

Visual C++
---
```text
public:
virtual property Rectangle^ DrawingAreaExtents {
	Rectangle^ get ();
}
```

# Remarks
The drawing area of the Revit window displays views (and sheets and schedules) of projects. The size of drawing area restricts the max size of the view titles and windows, the value may be empty if modal browser is opened. If there is no project opened, null will be returned.
# See Also
UIApplication Class
Autodesk.Revit.UI Namespace